
# -----------------------------------شروع فصل 7---------------------------
# ----------------------------انواع داده سطح 2------------------------------
# داده ها شامل : تاپل ها لیست ها دیکشنری رشته و... که هرکدام از این نوع داده هامتد های مخلفی دارند


# ----------------------------چهار تابع مهم که باید بلد باشی---------------------------




# --------------مثال ها---------
# 1
# print(divmod(10,3))
# 2
# print(pow(6,5,7))
# 3
# print(round(2.457654579,2))
# 4
# print(abs(-1384))

#----------------------------------int and float----------------------

# اتریبیوت ها یا همان متن های رشته:
# x = 5
print(dir(int))
#بررسی متد هایی که قبل و بعدشان اندرسکور ندارند
# x = 0.75
# y = 54
# print(x.as_integer_ratio())
# print(y.as_integer_ratio())

# ---------------

# x = 19
# print(x.bit_count())
# print(bin(19))

# ----------------

# x = 3 + 4j
# print(x.imag)
# print(x.real)
# print(x.conjugate())

# ------------------

# x = 45
# print(x.denominator)

# ----------------

x = 76887
print(x.numerator)





































































